# 01. Import Libraries

In [1]:
import pandas as pd
import numpy as np
import os

# 02. Import Data

In [2]:
# Path to main folder
path = r'C:\Users\jmacs\Documents\Career Foundry Tasks\01-2024 Instacart Basket Analysis'

In [3]:
# Importing ords_prods_merge dataframe
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_complete.pkl'))

In [4]:
ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,product_name,...,prices,price_range_loc,busiest_day,busiest_period_of_day,max_order,loyalty_flag,avg_order_price,spending_flag,avg_days_since_last_order,frequency_flag
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,9.0,Mid-range product,Regularly busy,Average Orders,10,New customer,6.367797,Low Spender,20.259259,Non-frequent customer
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,9.0,Mid-range product,Least busy,Average Orders,10,New customer,6.367797,Low Spender,20.259259,Non-frequent customer
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,9.0,Mid-range product,Least busy,Most Orders,10,New customer,6.367797,Low Spender,20.259259,Non-frequent customer
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,9.0,Mid-range product,Least busy,Average Orders,10,New customer,6.367797,Low Spender,20.259259,Non-frequent customer
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,9.0,Mid-range product,Least busy,Most Orders,10,New customer,6.367797,Low Spender,20.259259,Non-frequent customer

In [5]:
ords_prods_merge.shape

(32404859, 22)

In [6]:
# checking user_id data type
ords_prods_merge['user_id'].dtype

dtype('int64')

In [7]:
# changing the user_id to string
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')

In [8]:
ords_prods_merge['user_id'].dtype

dtype('O')

In [9]:
# Importing ords_prods_merge dataframe
customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [10]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [11]:
customers.shape

(206209, 10)

# 03. Data wrangling 'customers' dataframe

In [13]:
# customers dataframe overview
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [14]:
# customers data types
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [15]:
# customers statistics
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [12]:
# checking orders for mixed type values
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

First Name

In [20]:
# changing the columns of first name to string
customers['first_name'] = customers['first_name'].astype('str')

In [21]:
# checking orders for mixed type values (succesfully changed all first_name to string)
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

In [13]:
# deleting date_joined set from the dataframe
customers = customers.drop(columns = ['date_joined'])

In [14]:
# renaming surnam to last name
customers.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [15]:
# renaming First Name to first_name
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [16]:
# renaming n_dependants to dependants
customers.rename(columns = {'n_dependants' : 'dependants'}, inplace = True)

In [17]:
customers.head()

,user_id,first_name,last_name,Gender,STATE,Age,dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1,married,40374

In [18]:
# Changing data type for 'user_id'
customers['user_id'] = customers['user_id'].astype('str')

In [19]:
# checking change to string
customers['user_id'].dtype

dtype('O')

In [22]:
# checking customers dataframe for missing values. 
customers.isnull().sum()

user_id       0
first_name    0
last_name     0
Gender        0
STATE         0
Age           0
dependants    0
fam_status    0
income        0
dtype: int64

In [23]:
# checking for duplicates
df_dups = customers[customers.duplicated()]

In [24]:
# no duplicate rows found
df_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, Gender, STATE, Age, dependants, fam_status, income]
Index: []

# 04. Merging customers with ords_prods_merge

In [26]:
# creating new dataframe joining on user_id with indicatior
ords_prods_custs = ords_prods_merge.merge(customers, on = 'user_id', indicator = True)

In [27]:
# checking the merge column
ords_prods_custs['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [28]:
ords_prods_custs.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,product_name,...,frequency_flag,first_name,last_name,Gender,STATE,Age,dependants,fam_status,income,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both

In [30]:
ords_prods_custs.shape

(32404859, 30)

In [25]:
# creating new dataframe joining on user_id without the indicatior
ords_prods_custs = ords_prods_merge.merge(customers, on = 'user_id')

In [26]:
ords_prods_custs.shape

(32404859, 30)

In [27]:
# exporting ords_prods_custs in pickle format
ords_prods_custs.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers.pkl'))